tutorials/polydisperseBubblyFoam/angledMixer/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ode on;

coalescence on;

coalescenceKernel
{
    coalescenceFrequencyKernel CoulaloglouAndTavlarides;
    coalescenceEfficiencyKernel CoulaloglouAndTavlarides;

    Ca      Ca      [ 0 0 0 0 0 0 0 ]  0.88;
    Ceff    Ceff    [ 0 0 0 0 0 0 0 ]  6.0e9;
    ReExp   ReExp   [ 0 0 0 0 0 0 0 ]  -0.732;
    WeExp   WeExp   [ 0 0 0 0 0 0 0 ]  0.317;
}

breakup on;

breakupKernel
{
    breakupKernel Alopaeus;
    Cb        Cb        [ 0 0 -1 0 0 0 0 ] 6.0;
}

daughterDistribution
{
    daughterDistribution uniform;
}

odeCoeffs
{
    ATol    1.0e-6;
    RTol    1.0e-4;
    fac     0.5;
    facMin  0.1;
    facMax  2.0;
    minLocalDt 1.0e-10;
}

// ************************************************************************* //
