tutorials/polydisperseBubblyFoam/angledMixer/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type                fixedValue;
        value               uniform (0 10 0);
    }
    outlet
    {
        type                pressureInletOutletVelocity;
        phi                 phi.air;
        value               $internalField;
    }
    walls
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }
    defaultFaces
    {
        type                empty;
    }
}

// ************************************************************************* //
